use Garden;
insert type_of_tree(type_of_tree_id,breed)
values ('1','Липа'),
       ('2','Дуб'),
	   ('3','Клен'),
       ('4','Береза'),
       ('5','Ясень'),
       ('6','Пальма');
       
insert tree(tree_id,type_of_tree_id,date_of_cultivate,date_of_cut)
values ('1','1','09-03-07','21-10-21'),#1 липа
       ('2','3','10-03-07','21-10-21'),#2 клен
	   ('3','4','01-04-07','21-10-21'),#3 береза
       ('4','2','09-03-08','21-10-21'),#4 дуб
       ('5','5','10-03-08','21-10-21'),#5 ясень
	   ('6','4','01-04-08','21-10-21'),#6 береза
       ('7','1','09-03-09','21-10-21'),#7 липа
       ('8','3','10-03-09','21-10-21'),#8 клен
       ('9','2','11-03-09','21-10-21'),#9 дуб
	   ('10','2','01-04-09','21-10-21'),#10 дуб
       ('11','1','01-03-09','21-10-21'),#11 липа
       ('12','4','01-04-08','21-10-21'),#12 береза
       ('13','4','01-04-08','21-10-21');#13 береза
       
insert garden(garden_id,name_garden)
values ('1','Оккервиль');
insert alley(alley_id,garden_id,name_alley)
values ('1','1','первая'), 
       ('2','1','вторая'),
       ('3','1','третья'),
       ('4','1','четвертая');
       
insert tree_of_alley(tree_id,alley_id,location)
values ('1','1','1'),
       ('4','3','9'),   # аллеи на кот встр дубы
       ('9','3','10'),   #
       ('10','4','12'),  # дерево посаженное позже всех
       ('5','2','4'),  # дерево на пересечении двух аллей
       ('5','3','4'),  #      порода которой меньше всего
       ('3','1','2'),    # порода кот встр на всех аллеях
       ('6','2','5'),    #
       ('12','3','11'),   #
       ('13','4','13'),   #
       ('7','1','3'),    # растут липы нет кленов
       ('11','2','6'),   # растут липы и есть клен
       ('2','2','7'),    #
       ('8','2','8');    # 


/*update garden
set name_garden = 'Летний сад'
where name_garden = 'Оккервиль';
delete from type_of_tree
where breed = 'Пальма';*/
	


    
      